// pages/component/zhidao/ziliao/ziliao.js
Component({
  /**
   * 组件的属性列表
   */
  properties: {

  },

  /**
   * 组件的初始数据
   */
  data: {
      arr:[
        {
          src:"",
          small_img:"../../../../image/shili/u299.png",
          topic:"听障儿童听能管理",
          date:"2002-05-02",
          text:"听技能的获得是确保听障儿童获得有声言语康复的重要保证听技能的获得是确保听障儿童获得有声言语康复的重要保证听技能的获得是确保听障儿童获得有声言语康复的重要保证听技能的获得是确保听障儿童获得有声言语康复的重要保证",
          label:[
            "好人啊",
            "垃圾"
          ]
        },   {
          src:"",
          small_img:"../../../../image/shili/u299.png",
          topic:"听障儿童听能管理",
          date:"2002-05-02",
          text:"听技能的获得是确保听障儿童获得有声言语康复的重要保证听技能的获得是确保听障儿童获得有声言语康复的重要保证听技能的获得是确保听障儿童获得有声言语康复的重要保证听技能的获得是确保听障儿童获得有声言语康复的重要保证",
          label:[
            "好人啊",
            "垃圾"
          ]
        },   {
          src:"",
          small_img:"../../../../image/shili/u299.png",
          topic:"听障儿童听能管理",
          date:"2002-05-02",
          text:"听技能的获得是确保听障儿童获得有声言语康复的重要保证听技能的获得是确保听障儿童获得有声言语康复的重要保证听技能的获得是确保听障儿童获得有声言语康复的重要保证听技能的获得是确保听障儿童获得有声言语康复的重要保证",
          label:[
            "好人啊",
            "垃圾"
          ]
        },   {
          src:"",
          small_img:"../../../../image/shili/u299.png",
          topic:"听障儿童听能管理",
          date:"2002-05-02",
          text:"听技能的获得是确保听障儿童获得有声言语康复的重要保证听技能的获得是确保听障儿童获得有声言语康复的重要保证听技能的获得是确保听障儿童获得有声言语康复的重要保证听技能的获得是确保听障儿童获得有声言语康复的重要保证",
          label:[
            "好人啊",
            "垃圾"
          ]
        },   {
          src:"",
          small_img:"../../../../image/shili/u299.png",
          topic:"听障儿童听能管理",
          date:"2002-05-02",
          text:"听技能的获得是确保听障儿童获得有声言语康复的重要保证听技能的获得是确保听障儿童获得有声言语康复的重要保证听技能的获得是确保听障儿童获得有声言语康复的重要保证听技能的获得是确保听障儿童获得有声言语康复的重要保证",
          label:[
            "好人啊",
            "垃圾"
          ]
        },
      ]
  },

  /**
   * 组件的方法列表
   */
  methods: {

  }
})
