// pages/servers/qiye/post/post.js
const App = getApp()
Page({

  /**
   * 页面的初始数据
   */
  data: {
    height: 0,
    arr: {
      post_name: "爱心生产、行政后勤岗位",
      salary: "4000-8000",
      company_name: "广顺电子有限公司",
      company_major: "计算机、通信和其他电子设备制造业",
      company_label: [
        "20-99人",
        "私企",
        "互联网"
      ],
      demand: [
        "学历不限", "经历不限", "吃苦耐劳"
      ],
      date: "2020-05-20",
      position: "哈尔滨",
      post_describe: [
        "1、18~45岁优先，持残疾人证",
        "2、能够配合加班",
        "3、包吃住，年薪4万~7万（同工同酬)"
      ],
      trait: [
        "五险一金",
        "法定假日",
        "五险一金",
        "法定假日",
        "五险一金",
        "法定假日",
        "午餐",
        '包吃',
        "包住"
      ],
      content: `
      <img
        style="width:100%;height:100%"
      src="//n.sinaimg.cn/default/crawl/387/w550h637/20200805/c8a5-ixkvvuc0872260.png"></img>
      如何构建新发展格局 习近平这样“指路”
原标题：如何构建新发展格局 习近平这样“指路”
<br/>
一场突如其来的新冠肺炎疫情，让全球经济面临新的挑战。上半年经济数据显示，我国经济逐步克服疫情带来的不利影响，呈现恢复性增长和稳步复苏，二季度经济增速实现由负转正。
<br/>
“危和机总是同生并存的，克服了危即是机。”对于非常时期的中国经济复苏，习近平总书记要求坚持用全面、辩证、长远的眼光分析当前经济形势，努力在危机中育新机、于变局中开新局，并逐步形成以国内大循环为主体、国内国际双循环相互促进的新发展格局。
<br/>
新冠肺炎疫情暴发以来，习近平总书记多次深入地方考察调研、主持召开重要会议，为当前形势下如何更加客观、冷静分析国内外经济运行形势，如何采取积极有效的应对措施等给出明确信号，为构建新发展格局指明前进方向。央视网《联播+》特梳理，以飨读者。
<br/>
（中央广播电视总台央视网）
      `,
      otherPost:[
        {
          post_name: "爱心生产、行政后勤岗位",
          demand: [
            "学历不限", "经历不限", "吃苦耐劳"
          ],
          date: "2020-05-20",
          salary: "4000-8000",
          trait: [
            "五险一金",
            "法定假日",
            "五险一金",
            "法定假日",
            "五险一金",
            "法定假日",
            "午餐",
            '包吃',
            "包住"
          ],
        },
        {
          post_name: "保洁",
          demand: [
            "学历不限", "经历不限", "吃苦耐劳"
          ],
          date: "2020-05-20",
          salary: "10000",
          trait: [
            
            "午餐",
            '包吃',
            "包住"
          ],
        },  
        {
          post_name: "前端",
          demand: [
            "学历不限", "经历不限", "吃苦耐劳"
          ],
          date: "2020-05-20",
          salary: "4000-8000",
          trait: [
            "五险一金",
            "法定假日",
           "加班奖励",
            "午餐",
            '包吃',
            "包住"
          ],
        }
      ]
    }
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    this.setData({
      height: App.globalData.navHeight
    })
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})